results-n1-standard-4-20-second-tests/0025-cache-summary.txt

          /\      |‾‾|  /‾‾/  /‾/   
     /\  /  \     |  |_/  /  / /    
    /  \/    \    |      |  /  ‾‾\  
   /          \   |  |‾\  \ | (_) | 
  / __________ \  |__|  \__\ \___/ .io

  execution: local
     output: -
     script: har-test-script.js

    duration: -, iterations: -
         vus: 1, max: 25

    init [----------------------------------------------------------] starting
    █ page_1 - https://test.devopsdirective.com/posts/2020/03/always-on-minikube/

      ✓ http2 is used
      ✓ status is 200
      ✓ content is present

    check_failure_rate.........: 0.00%   ✓ 0    ✗ 1487
    checks.....................: 100.00% ✓ 4461 ✗ 0   
    data_received..............: 709 MB  35 MB/s
    data_sent..................: 2.4 MB  119 kB/s
    group_duration.............: avg=167.73ms min=145.98ms med=160.25ms max=396.74ms p(90)=190.03ms p(95)=213.2ms 
    http_req_blocked...........: avg=43.78µs  min=156ns    med=389ns    max=127.33ms p(90)=788ns    p(95)=1.01µs  
    http_req_connecting........: avg=15.74µs  min=0s       med=0s       max=12.83ms  p(90)=0s       p(95)=0s      
    http_req_duration..........: avg=24.82ms  min=11.37ms  med=21.34ms  max=295.64ms p(90)=36.09ms  p(95)=44.17ms 
    http_req_receiving.........: avg=731.87µs min=47.87µs  med=188.1µs  max=35.96ms  p(90)=1.99ms   p(95)=2.59ms  
    http_req_sending...........: avg=37.53µs  min=10.82µs  med=37.25µs  max=1.17ms   p(90)=55.02µs  p(95)=64.17µs 
    http_req_tls_handshaking...: avg=23.53µs  min=0s       med=0s       max=81.61ms  p(90)=0s       p(95)=0s      
    http_req_waiting...........: avg=24.05ms  min=11.23ms  med=20.69ms  max=295.08ms p(90)=34.83ms  p(95)=42.35ms 
    http_reqs..................: 17911   895.546328/s
    iteration_duration.........: avg=167.78ms min=146.03ms med=160.3ms  max=396.76ms p(90)=190.07ms p(95)=213.24ms
    iterations.................: 1473    73.649698/s
    vus........................: 24      min=2  max=24
    vus_max....................: 25      min=25 max=25